examples/hot-point-drill-twoPhase/Allmesh
blockMesh
splitMeshRegions -cellZones all -overwrite -noFields
rm constant/cellToRegion
rm 0/cellToRegion
paraFoam -region water -touch
paraFoam -region ice -touch
