examples/hot-point-drill-twoPhase/system/calculatePhi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            coded;

libs            ("libutilityFunctionObjects.so");

name            calculatePhi;

codeInclude
#{
    #include "volFields.H"
    #include "surfaceFields.H"
#};

codeExecute
#{
    const dimensionedVector v(dimVelocity, vector(0, 5e-4, 0));

    tmp<surfaceScalarField> tphi = surfaceScalarField::New
    (
        "phi",
        v & mesh().Sf()
    );
    store(tphi);
#};


// ************************************************************************* //
