examples/hot-point-drill-twoPhase/system/functions
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


temperatureTransportWater
{
    type            scalarTransport;
    libs            ( "libsolverFunctionObjects.so" );
    field           T;
    diffusivity     constant;
    D               0.15e-6;
    execteControl   timeStep;
    writeControl    writeTime;
    region          water;
}

#includeFunc calculatePhi(region=ice)

temperatureTransportIce
{
    type            scalarTransport;
    libs            ( "libsolverFunctionObjects.so" );
    field           T;
    diffusivity     constant;
    D               1.02e-6;
    execteControl   timeStep;
    writeControl    writeTime;
    region          ice;
}


drag
{
    type            forces;
    libs            ( "libforces.so" );
    patches         ( head shaft );
    rho             rhoInf;
    rhoInf          1000;
    CofR            ( 0 0 0 );
    region          water;
}

// ************************************************************************* //
