examples/hot-point-drill-twoPhase/system/ice/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    cellMotionU
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-3;
        relTol          0;
    }

    T
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
        nCorrectors     2;  //acts as non-orthogonal correctors
    }
}


PIMPLE
{
    outerCorrectorResidualControl
    {
        // dummmy values to converge immediately
        // actual residual control is done by fluid domain
        T
        {
            tolerance   1.797e308;
            relTol      1;
        }
    }
}

relaxationFactors
{
    equations
    {
        default      0;
        T            1;
    }
}


// ************************************************************************* //
