examples/hot-point-drill-twoPhase/system/water/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.1;
    }

    pcorr
    {
        $p
        tolerance       1e-03;
        relTol          0;
    }

    cellMotionU
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-4;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.1;
    }

    T
    {
	solver		PBiCGStab;
	preconditioner	DILU;
	tolerance	1e-6;
        relTol          0;
        nCorrectors     2;  //acts as non-orthogonal correctors
    }
}

PIMPLE
{
    correctPhi	no;
    moveMeshOuterCorrectors no;
    nNonOrthogonalCorrectors 2;
    consistent      yes;
    nCorrectors	1;

    outerCorrectorResidualControl
    {
	p
	{
	    tolerance	1e-5;
	    relTol	0;
	}
    }
}

relaxationFactors
{
    fields
    {
	default 0;
	pFinal  1;
    }
    equations
    {
	default      0;
        "(U|UFinal)" 0.9;
        T            1;
    }
}


// ************************************************************************* //
